# ####################################################################

#  Created by Genus(TM) Synthesis Solution 17.22-s017_1 on Sat Feb 16 12:01:24 IST 2019

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design DPA1

create_clock -name "clk" -period 26.0 -waveform {0.0 13.0} 
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[63]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[62]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[61]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[60]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[59]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[58]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[57]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[56]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[55]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[54]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[53]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[52]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[51]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[50]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[49]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[48]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[47]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[46]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[45]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[44]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[43]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[42]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[41]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[40]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[39]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[38]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[37]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[36]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[35]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[34]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[33]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[32]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {a[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[63]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[62]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[61]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[60]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[59]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[58]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[57]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[56]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[55]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[54]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[53]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[52]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[51]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[50]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[49]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[48]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[47]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[46]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[45]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[44]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[43]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[42]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[41]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[40]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[39]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[38]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[37]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[36]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[35]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[34]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[33]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[32]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {b[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports cin]
set_input_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports signed_en]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports cout]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[63]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[62]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[61]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[60]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[59]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[58]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[57]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[56]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[55]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[54]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[53]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[52]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[51]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[50]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[49]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[48]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[47]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[46]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[45]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[44]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[43]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[42]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[41]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[40]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[39]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[38]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[37]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports {final_sum[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports negative_flag]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports overflow_flag]
set_output_delay -clock [get_clocks clk] -add_delay 7.8 [get_ports zero_flag]
set_wire_load_mode "enclosed"
set_dont_use [get_lib_cells fast_vdd1v0/HOLDX1]
